import React from 'react';
import Navbar from '../components/Navbar'
import Footer from '../components/Footer'
import 'bootstrap/dist/css/bootstrap.min.css';
import './templehistory.css'
const TempleHistory = () => {
  return (
    <>
    <Navbar/>
    <div className="container my-4" >
      <div
        className="p-4 rounded shadow"
        style={{
          background: 'linear-gradient(135deg, #ffe6cc, #ffcc80)', // Lighter orange gradient
          color: '#663300', // Warm brown color matching the gradient
          fontWeight:"600",
          marginTop:"9rem"
        
        }}
      >
        <h2 className="text-center mb-3">श्री बांके बिहारी मंदिर का इतिहास</h2>
        <p>
          वृंदावन का श्री बांके बिहारी मंदिर विश्व प्रसिद्ध मंदिरों में से एक हैं. यहां लाखों की तादाद में श्रद्धालु दर्शन करने के लिए आते हैं. यहां ठाकुर जी की कृष्‍ण रंग के दर्शन करने के लिए भक्‍तों की भारी भीड़ आती है. मंगला आरती के समय यह भीड़ और भी ज्‍यादा बढ़ जाती है. इसके अलावा जन्‍माष्‍टमी, होली, नए साल के मौके पर तो यहां मानो श्रद्धालुओं का समंदर उमड़ पड़ता है.
        </p>
        <p>
          मंदिर में ठाकुर जी की मंगला आरती के साक्षी बनने के लिए यहां श्रद्धालुओं की भारी भीड़ पहुंचती है. आम दिनों में भी वृंदावन में पहुंचने वाले श्रद्धालुओं की संख्या एक लाख प्रतिदिन पहुंच गई है. वहीं सप्ताहांत पर यह संख्‍या एक लाख पार कर जाती है. इसके अलावा होली, जन्‍माष्‍टमी, लंबे सप्ताहांत और नए साल के मौके पर यहां प्रतिदिन 5 से 7 लाख तक श्रद्धालु पहुंचते हैं.
        </p>
        <p>
          चूंकि श्री बांके बिहारी मंदिर, वृंदावन के सबसे प्रसिद्ध मंदिर में से एक है अत: वृंदावन आने वाले श्रद्धालु इस मंदिर में ठाकुर जी के दर्शन करने के लिए जरूर आते हैं.
        </p>
        <p>
          श्री बांके बिहारी मंदिर का निर्माण 1860 में कराया गया था. इस मंदिर में स्‍थापित श्री बांके बिहारी की यह छवि स्वामी श्री हरिदास जी ने निधि वन में खोजी थी. स्वामी श्री हरिदास जी भगवान श्री कृष्ण के अनन्य भक्त थे और उनका संबंध निम्बर्क पंथ से था. बाद में स्‍वामी श्री हरिदास जी के अनुयायियों ने 1921 में इस मंदिर का पुनर्निर्माण कराया था.
        </p>
        <p>
          श्री बांके बिहारी मंदिर में स्‍थापित बिहारी जी की काले रंग की प्रतिमा है. मान्यता है कि इस प्रतिमा में साक्षात् भगवान श्री कृष्ण और राधारानी समाए हुए हैं. इस मूर्ति के दर्शन से राधारानी और श्री कृष्ण दोनों के दर्शन करने का फल मिल जाता है.
        </p>
        <p>
          हर साल अक्षय तृतीया यानी कि मार्गशीर्ष मास की पंचमी तिथि को श्री बांके बिहारी मंदिर में श्री बांके बिहारी प्रकटोत्सव मनाया जाता है. साल में केवल इसी दिन श्री बांके बिहारी के चरणों के दर्शन होते हैं. इस दिन भगवान के चरणों के दर्शन करना बहुत शुभ होता है.
        </p>
      </div>
    </div>
    <Footer></Footer>
    </>
  );
};

export default TempleHistory;
